import {Dimensions} from 'react-native';

export const WIDTH = Dimensions.get('window').width / 2 - 65;

export const Height = Dimensions.get('window').height / 3 - 45;

export const data1 = [
  {
    source: require('../../img/For_You/1.jpg'),
    title: 'تنمية الإبداع لدى \n الأبناء',
    author: 'محمد السيد عبد الرزاق',
    id: 1,
    NumPages: 5,
    Time: 13,
    ForWhom: 'هذا الكتاب للمهتمين بمعرفة............الخ',
    AboutAuthor:
      'هنا يظهر معلومات عن مؤلف الكتاب {اسم الكاتب / أصوله / تخصصاته /أهم أعماله و كتبه...}',
    Description:
      'هنا يجب أن يظهر وصف كتاب {تنمية الإبداع لدى الأبناء} للكاتب محمد السيد عبد الرزاق هنا يجب أن يظهر وصف كتاب {تنمية الإبداع لدى الأبناء} للكاتب محمد السيد عبد الرزاق هنا يجب أن يظهر وصف كتاب {تنمية الإبداع لدى الأبناء} للكاتب {محمد السيد عبد الرزاق}',
    text: 'هنا يجب أن يظهر نص كتاب تنمية الإبداع لدى الأبناء للكاتب محمد السيد عبد الرزاق هنا يجب أن يظهر نص كتاب تنمية الإبداع لدى الأبناء للكاتب محمد السيد عبد الرزاقهنا يجب أن يظهر نص كتاب تنمية الإبداع لدى الأبناء للكاتب محمد السيد عبد الرزاق',
    content: [
      {
        title: 'مُقدِّمة',
        text: 'في الوقت الذي غزا فيه الإنترنت العالم أجمع، لا شك أن هناك إيجابيات تمثَّلت في استحداث مجالات عمل جديدة كلها تندرج تحت عنوان "التسويق"، فمحرِّكات البحث ووسائل التواصل الاجتماعي والمواقع الإلكتروني كلها تربح من فكرة صناعة المحتوى بالتسويق، ومن تلك الفكرة جاء أساس العمل الحر عبر الإنترنت بمختلف تفرُّعاته المتعلِّقة بكتابة المحتوى والتصميم والتسويق والبرمجة وما إلى ذلك. ولم يعد ذلك المجال مجرد وضع جديد منحصر، وإنما أصبح قوة اقتصادية تصل إلى نحو 40% من القوى العاملة في دولة كالولايات المتحدة، إضافةً إلى ذلك فهو يُعدُّ فرصة حقيقية يستطيع بها الإنسان تحسين وضعه المادي وتنويع مصادر دخله مع صعوبة الحصول على الوظائف التقليدية في عالمنا العربي، إذًا فكيف تبدأ في هذا المجال؟',
      },
      {
        title: 'أهمية الاستقلال المادي',
        text: 'نص أهمية الاستقلال المادي',
      },
      {
        title: 'مرض عصري جديد!',
        text: 'نص مرض عصري جديد!',
      },
      {
        title: ' اهتزاز الثقة بالنفس وأثرها',
        text: 'نص اهتزاز الثقة بالنفس وأثرها',
      },
      {
        title: ' النميمة والشك',
        text: 'نص النميمة والشك',
      },
      {
        title: 'عنوان الخاتمة',
        text: 'نص الخاتمة .',
      },
    ],
  },
  {
    source: require('../../img/For_You/2.jpg'),
    title: 'قوةُ عقلِكَ الباطن',
    author: 'جوزيف ميرفي',
    id: 2,
    NumPages: 3,
    Time: 8,
    ForWhom: 'هذا الكتاب للمهتمين بمعرفة............الخ',
    AboutAuthor:
      'هنا يظهر معلومات عن مؤلف الكتاب {اسم الكاتب / أصوله / تخصصاته /أهم أعماله و كتبه...}',
    Description:
      'هنا يجب أن يظهر وصف كتاب {قوةُ عقلِكَ الباطن} للكاتب {جوزيف ميرفي}',
    text: 'هنا يجب أن يظهر نص كتاب قوةُ عقلِكَ الباطن للكاتب جوزيف ميرفي هنا يجب أن يظهر نص كتاب قوةُ عقلِكَ الباطن للكاتب جوزيف ميرفي هنا يجب أن يظهر نص كتاب قوةُ عقلِكَ الباطن للكاتب جوزيف ميرفي',
    content: [
      {
        title: 'عذراً',
        text: 'عذراً, لم يتم إضافة محتوى بعد',
      },
    ],
  },
  {
    source: require('../../img/For_You/3.jpg'),
    title: 'بين الآباء و الأبناء\n تجارب واقعية',
    author: 'محمد سليم العوا',
    id: 3,
    NumPages: 2,
    Time: 6,
    ForWhom: 'هذا الكتاب للمهتمين بمعرفة............الخ',
    AboutAuthor:
      'هنا يظهر معلومات عن مؤلف الكتاب {اسم الكاتب / أصوله / تخصصاته /أهم أعماله و كتبه...}',
    Description:
      'هنا يجب أن يظهر وصف كتاب {بين الآباء و الأبناء تجارب واقعية} للكاتب {محمد سليم العوا}',
    text: 'هنا يجب أن يظهر نص كتاب بين الآباء و الأبناء تجارب واقعية للكاتب محمد سليم العوا هنا يجب أن يظهر نص كتاب بين الآباء و الأبناء تجارب واقعية للكاتب محمد سليم العوا هنا يجب أن يظهر نص كتاب بين الآباء و الأبناء تجارب واقعية للكاتب محمد سليم العوا',
  },
  {
    source: require('../../img/For_You/4.jpg'),
    title: 'مسؤولية المثقف',
    author: 'علي شريعتي',
    id: 4,
    NumPages: 6,
    Time: 15,
    ForWhom: 'هذا الكتاب للمهتمين بمعرفة............الخ',
    AboutAuthor:
      'هنا يظهر معلومات عن مؤلف الكتاب {اسم الكاتب / أصوله / تخصصاته /أهم أعماله و كتبه...}',
    Description:
      'هنا يجب أن يظهر وصف كتاب {مسؤولية المثقف} للكاتب {علي شريعتي}',
    text: 'هنا يجب أن يظهر نص كتاب مسؤولية المثقف للكاتب علي شريعتي هنا يجب أن يظهر نص كتاب مسؤولية المثقف للكاتب علي شريعتي هنا يجب أن يظهر نص كتاب مسؤولية المثقف للكاتب علي شريعتي',
  },
  {
    source: require('../../img/For_You/5.jpg'),
    title: 'الخطة البراقة لذي \n النفس التواقة',
    author: 'صلاح الخالدي',
    id: 5,
    NumPages: 7,
    Time: 19,
    ForWhom: 'هذا الكتاب للمهتمين بمعرفة............الخ',
    AboutAuthor:
      'هنا يظهر معلومات عن مؤلف الكتاب {اسم الكاتب / أصوله / تخصصاته /أهم أعماله و كتبه...}',
    Description:
      'هنا يجب أن يظهر وصف كتاب {الخطة البراقة لذي النفس التواقة} للكاتب {صلاح الخالدي}',
    text: 'هنا يجب أن يظهر نص كتاب الخطة البراقة لذي النفس التواقة للكاتب صلاح الخالدي هنا يجب أن يظهر نص كتاب الخطة البراقة لذي النفس التواقة للكاتب صلاح الخالدي هنا يجب أن يظهر نص كتاب الخطة البراقة لذي النفس التواقة للكاتب صلاح الخالدي',
  },
  {
    source: require('../../img/For_You/6.jpg'),
    title: 'يوم ، شهر ، سنة',
    author: 'أحمد خيري العمري',
    id: 6,
    NumPages: 8,
    Time: 21,
    ForWhom: 'هذا الكتاب للمهتمين بمعرفة............الخ',
    AboutAuthor:
      'هنا يظهر معلومات عن مؤلف الكتاب {اسم الكاتب / أصوله / تخصصاته /أهم أعماله و كتبه...}',
    Description:
      'هنا يجب أن يظهر وصف كتاب {يوم ، شهر ، سنة} للكاتب {أحمد خيري العمري}',
    text: 'هنا يجب أن يظهر نص كتاب يوم ، شهر ، سنة للكاتب أحمد خيري العمري هنا يجب أن يظهر نص كتاب يوم ، شهر ، سنة للكاتب أحمد خيري العمري هنا يجب أن يظهر نص كتاب يوم ، شهر ، سنة للكاتب أحمد خيري العمري',
  },
  {
    source: require('../../img/For_You/7.jpg'),
    title: 'مدرسة محمد صلّى \n الله عليه و سلم',
    author: 'جهاد الترباني',
    id: 7,
    NumPages: 5,
    Time: 11,
    ForWhom: 'هذا الكتاب للمهتمين بمعرفة............الخ',
    AboutAuthor:
      'هنا يظهر معلومات عن مؤلف الكتاب {اسم الكاتب / أصوله / تخصصاته /أهم أعماله و كتبه...}',
    Description:
      'هنا يجب أن يظهر وصف كتاب {مدرسة محمد صلّى الله عليه و سلم} للكاتب {جهاد الترباني}',
    text: 'هنا يجب أن يظهر نص كتاب مدرسة محمد صلّى الله عليه و سلم للكاتب جهاد الترباني هنا يجب أن يظهر نص كتاب مدرسة محمد صلّى الله عليه و سلم للكاتب جهاد الترباني هنا يجب أن يظهر نص كتاب مدرسة محمد صلّى الله عليه و سلم للكاتب جهاد الترباني',
  },
  {
    source: require('../../img/For_You/8.jpg'),
    title: 'معالم الرجولة في \n القرآن الكريم',
    author: 'عبد الكريم صالح',
    id: 8,
    NumPages: 4,
    Time: 10,
    ForWhom: 'هذا الكتاب للمهتمين بمعرفة............الخ',
    AboutAuthor:
      'هنا يظهر معلومات عن مؤلف الكتاب {اسم الكاتب / أصوله / تخصصاته /أهم أعماله و كتبه...}',
    Description:
      'هنا يجب أن يظهر وصف كتاب {معالم الرجولة في القرآن الكريم} للكاتب {عبد الكريم صالح}',
    text: 'هنا يجب أن يظهر نص كتاب معالم الرجولة في القرآن الكريم للكاتب عبد الكريم صالح هنا يجب أن يظهر نص كتاب معالم الرجولة في القرآن الكريم للكاتب عبد الكريم صالح هنا يجب أن يظهر نص كتاب معالم الرجولة في القرآن الكريم للكاتب عبد الكريم صالح',
  },
  {
    source: require('../../img/For_You/9.jpg'),
    title: 'من نفحات الحرم',
    author: 'علي الطنطاوي',
    id: 9,
    NumPages: 3,
    Time: 8,
    ForWhom: 'هذا الكتاب للمهتمين بمعرفة............الخ',
    AboutAuthor:
      'هنا يظهر معلومات عن مؤلف الكتاب {اسم الكاتب / أصوله / تخصصاته /أهم أعماله و كتبه...}',
    Description:
      'هنا يجب أن يظهر وصف كتاب {من نفحات الحرم} للكاتب {علي الطنطاوي}',
    text: 'هنا يجب أن يظهر نص كتاب من نفحات الحرم للكاتب علي الطنطاوي هنا يجب أن يظهر نص كتاب من نفحات الحرم للكاتب علي الطنطاوي هنا يجب أن يظهر نص كتاب من نفحات الحرم للكاتب علي الطنطاوي',
  },
];
export const dataSections = [
  {
    title: 'النمو الشخصي',
    source: require('../../img/sections/4.png'),
    id: 1,
  },
  {
    title: 'السياسة و الاقتصاد',
    source: require('../../img/sections/5.png'),
    id: 2,
  },
  {
    title: 'ريادة الأعمال',
    source: require('../../img/sections/1.png'),
    id: 3,
  },
  {
    title: 'التسوق و المبيعات',
    source: require('../../img/sections/6.png'),
    id: 4,
  },
  {
    title: 'الصحة و اللياقة',
    source: require('../../img/sections/3.png'),
    id: 5,
  },
  {
    title: 'القيادة و الإدارة',
    source: require('../../img/sections/7.png'),
    id: 6,
  },
  {
    title: 'مهارات التواصل',
    source: require('../../img/sections/9.png'),
    id: 7,
  },
  {
    title: 'المال و الاستثمار',
    source: require('../../img/sections/14.png'),
    id: 8,
  },
  {
    title: 'الفكر و الفلسفة',
    source: require('../../img/sections/10.png'),
    id: 9,
  },
  {
    title: 'علوم إسلامية',
    source: require('../../img/sections/8.png'),
    id: 10,
  },
  {
    title: 'نفس واجتماع',
    source: require('../../img/sections/12.png'),
    id: 11,
  },
  {
    title: 'السير و التاريخ',
    source: require('../../img/sections/17.png'),
    id: 12,
  },
  {
    title: 'العلوم و المعارف',
    source: require('../../img/sections/11.png'),
    id: 13,
  },
  {
    title: 'الأبوة و الأمومة',
    source: require('../../img/sections/15.png'),
    id: 14,
  },
  {
    title: 'العلاقات العاطفية',
    source: require('../../img/sections/13.png'),
    id: 15,
  },
  {
    title: 'التكنولوجيا والمستقبل',
    source: require('../../img/sections/16.png'),
    id: 16,
  },
];
export const dataBook_Reviews = [
  {
    source: require('../../img/ImgBook_Reviews/1.jpg'),
    id: 1,
  },
  {
    source: require('../../img/ImgBook_Reviews/3.jpg'),
    id: 2,
  },
  {
    source: require('../../img/ImgBook_Reviews/2.jpg'),
    id: 3,
  },
  {
    source: require('../../img/ImgBook_Reviews/4.jpg'),
    id: 4,
  },
];
export const dataGreen_folders = [
  {
    source: require('../../img/GreenFolders/5.jpg'),
    title: 'أمراض الجهاز الهضمي',
    num: 4,
    id: 1,
  },
  {
    source: require('../../img/GreenFolders/4.jpg'),
    title: 'بريان ترس',
    num: 3,
    id: 2,
  },
  {
    source: require('../../img/GreenFolders/3.jpg'),
    title: 'السلوك و الأمراض النفسية',
    num: 10,
    id: 3,
  },
  {
    source: require('../../img/GreenFolders/2.jpg'),
    title: 'أحمد خيري العمري',
    num: 6,
    id: 4,
  },
  {
    source: require('../../img/GreenFolders/6.jpg'),
    title: 'أمراض القلب و الأوعية....',
    num: 4,
    id: 5,
  },
  {
    source: require('../../img/GreenFolders/1.jpg'),
    title: 'نحو صحة أفضل',
    num: 13,
    id: 6,
  },
];
export const dataOnBoarding = [
  {
    id: '1',
    image: require('../../img/OnBoarding/Books.png'),
    title: 'مكتبة ضخمة و متجددة باستمرار',
  },
  {
    id: '2',
    image: require('../../img/OnBoarding/ReadBook.png'),
    title: 'القراءة والاستماع في نفس الوقت',
  },
  {
    id: '3',
    image: require('../../img/OnBoarding/marker.png'),
    title: 'تمييز النصوصو تدوين الملاحظات',
  },
  {
    id: '4',
    image: require('../../img/OnBoarding/download.png'),
    title: 'الوصول للملخصات بدون إنترنت',
  },
];
